{"pageProps":{"post":{"title":"A shopping cart project using Nextjs and React Hook for e-commerce","date":"2020-08-2T21:20:16.173Z","description":"A simple and elegant shopping cart component that can be easily integrated in e-commerce project, using Nextjs, Hook and Typescript","slug":"next-react-shopping-cart","content":"\n**[DEMO](https://next-shopping-cart.vercel.app)**\n\nThis project is based on [react-shopping-cart](https://github.com/sivadass/react-shopping-cart), which is a web shopping cart using react and sass. However, in this fast-chaning world, this react-shopping cart is outdated. We will refactore this project using Nextjs, react hook and typescript.\n\nYou can check the code of this project on [Github](https://github.com/zjusticy/next-shopping-cart).\n\n![](/next-react-shopping-cart.gif)\n\n## Next.js\n\nNext.js is a lightweight React server-side rendering application framework. With it, we can simply and easily implement React server-side rendering, thus speeding up the first screen, and also doing SEO. Now Next.js is more powerful that can combine server-side rendering (SSR) and static site generation (SSG) to provide a more fluid experience. You can check more about Next.js [here](https://nextjs.org/docs/getting-started).\n\nSince we only have one single page, the file structure for page folder:\n\n```bash\nproject \n├── index.tsx \n└── _app.tsx # add head section \n```\n\nWe also use SSG to get a better performance. Also, Because static site does not rely on Web Server, deployment is just to put the generated web page on the CDN. Data are fetched by build in function \"getStaticProps“. \n\n```js\nexport const getStaticProps: GetStaticProps = async () => {\n  const url =\n    \"https://res.cloudinary.com/sivadass/raw/upload/v1535817394/json/products.json\";\n  const res = await axios.get(url);\n\n  const data = await res.data;\n\n  return { props: { products: data } };\n};\n```\n\nIts time to first byte (TTFB) performance is the best.\n\n## Hook\n\nHook is a new feature of React 16.8. It allows you to use state and other React features without writing a class. Comparing to higher order component, it can be more elegant and efficient.\n\nBelow we have a state `isAdded` to indicate a product has successfully added to the cart.\n\n```js\nthis.state = {\n  isAdded: false\n};\n```\n\nChange to the hook:\n\n```js\nconst [isAdded, setAddState] = useState<boolean>(false);\n```\n\nMoreover, we can customise our own hooks. Below is some code from the original project to determine the position of the click:\n\n```js\nhandleClickOutside(event) {\n  const cartNode = findDOMNode(this.refs.cartPreview);\n  const buttonNode = findDOMNode(this.refs.cartButton);\n  if (cartNode.classList.contains(\"active\")) {\n    if (!cartNode || !cartNode.contains(event.target)) {\n      this.setState({\n        showCart: false\n      });\n      event.stopPropagation();\n    }\n  }\n}\ncomponentDidMount() {\n  document.addEventListener(\n    \"click\",\n    this.handleClickOutside.bind(this),\n    true\n  );\n}\ncomponentWillUnmount() {\n  document.removeEventListener(\n    \"click\",\n    this.handleClickOutside.bind(this),\n    true\n  );\n}\n```\n\nTo make the code more reusable, we implement the same function by hook:\n\n```js\nimport { useEffect } from \"react\";\n\nconst useClickOutside = (\n  closeModel: () => void,\n  ref: React.RefObject<HTMLDivElement>,\n  // whether to check if the component active or not\n  activeCheck: boolean\n) => {\n  const  handleClickOutside  = (e:  MouseEvent) => {\n\n  if (ref && ref.current && !ref.current.contains(e.target as Element)) {\n    if (activeCheck) {\n      e.stopPropagation();\n    }\n    closeModel();\n  }\n};\n\n  useEffect(() => {\n    // add when mounted\n    document.addEventListener(\"click\", handleClickOutside, true);\n    // return function to be called when unmounted\n    return () => {\n      document.removeEventListener(\"click\", handleClickOutside, true);\n    };\n  }, []);\n};\n\nexport default useClickOutside;\n```\n\nWe also put some states: `cart`, `totalItems` and `totalAmount` to the context which enable a more organized global state management. After this, we can use `useContext` hook inside the pages or components to introduce the needed state or function.\n\n```js\n  const {\n    cart,\n    totalItems,\n    totalAmount,\n    removeProduct,\n    bounce,\n    bouceEnd,\n  } = useContext<Init>(CartContext);\n```\n\n## Typescript\n\n[Typescript](https://www.typescriptlang.org/docs/handbook/typescript-in-5-minutes.html)  is a strongly typed version of JavaScript. Then the type and unique syntax are removed during the compile time to generate pure JavaScript code. Since it is still JavaScript running in the browser in the end, TypeScript does not depend on the support of the browser, nor does it cause compatibility issues.\n\nTypeScript increases the readability and maintainability of the code.\n\n\n## Height fixed when the image is not loaded\n\nThe width of some pictures is determined, and the height is adaptive. When the picture is not loaded, the height is 0. After the loading is completed, its height is stretched, which will cause the page to flicker and jitter during this process. But there is no way to control the height. If the width and height of the picture are inconsistent, and the width setting is the same, the height will be uneven.\n\nAt this time, you can use padding to control the height of the picture, so that the pictures in the list are forced to set the same height. Take the setting on Amazon as an example. The height of the img-box is opened with padding-top/padding-bottom.\n\n```html\n<head>\n  <style>\n    .img-box {\n      position: relative;\n      padding-top: 100%;\n    }\n\n    .img {\n      position: absolute;\n      margin: auto;\n      top: 0;\n      bottom: 0;\n      left: 0;\n      right: 0;\n      max-width: 100%;\n      max-height: 100%;\n    }\n  </style>\n</head>\n\n<div class=\"img-box\">\n  <img class='img' src=\"./images/melon.png\" alt=\"\">\n</div>\n\n```\n\nThe result is illustrated by the image below. Although the three images of pan have different heights, they all have the image boxes that have the same height and width. The image itself is centered by setting the margin to auto.\n\n![Settings on Amazon website](/amazonPic.png)\n\n\n## Reference\n\n[react-shopping-cart](https://github.com/sivadass/react-shopping-cart) \n\n\n\n\n\n\n\n"}},"__N_SSG":true}